/*++
linux/drivers/serial/serial_wmt.c

Copyright (c) 2008  WonderMedia Technologies, Inc.

This program is free software: you can redistribute it and/or modify it under the
terms of the GNU General Public License as published by the Free Software Foundation,
either version 2 of the License, or (at your option) any later version.

This program is distributed in the hope that it will be useful, but WITHOUT
ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A
PARTICULAR PURPOSE.  See the GNU General Public License for more details.
You should have received a copy of the GNU General Public License along with
this program.  If not, see <http://www.gnu.org/licenses/>.

WonderMedia Technologies, Inc.
10F, 529, Chung-Cheng Road, Hsin-Tien, Taipei 231, R.O.C.
--*/

#include <linux/module.h>
#include <linux/tty.h>
#include <linux/tty_flip.h>
#include <linux/ioport.h>
#include <linux/init.h>
#include <linux/serial.h>
#include <linux/console.h>
#include <linux/sysrq.h>
#include <linux/device.h>
#include <linux/delay.h>
#include <linux/cpufreq.h>
#include <linux/platform_device.h>
#include <asm/io.h>
#include <asm/irq.h>
#include <mach/hardware.h>
#include <mach/dma.h>
#include <linux/serial_core.h>
#include <linux/dma-mapping.h>
#include <linux/slab.h>


#define PORT_WMT 54
#if defined(CONFIG_SERIAL_WMT_CONSOLE) && defined(CONFIG_MAGIC_SYSRQ)
#define SUPPORT_SYSRQ
#endif


#ifdef CONFIG_SERIAL_WMT_DMA
/* * DMA processing */
#define DMA_RX_REQUEST(s, cb)	wmt_request_dma(&s->rx_dmach, s->id, s->dma_rx_dev, cb, s)
#define DMA_RX_FREE(s)		{wmt_free_dma(s->rx_dmach); s->rx_dmach = NULL_DMA; }
#define DMA_RX_START(s, d, l)	wmt_start_dma(s->rx_dmach, d, 0, l)
#define DMA_RX_POS(s)		wmt_get_dma_pos(s->rx_dmach)
#define DMA_RX_STOP(s)		wmt_stop_dma(s->rx_dmach)
#define DMA_RX_CLEAR(s)		wmt_clear_dma(s->rx_dmach)
#define DMA_RX_RESET(s)		wmt_reset_dma(s->rx_dmach)
#define IS_NULLDMA(ch)		((ch) == NULL_DMA)
#define CHK_DMACH(ch)		((ch) != NULL_DMA)
#define DMA_TX_REQUEST(s, cb)	wmt_request_dma(&s->tx_dmach, s->id, s->dma_tx_dev, cb, s)
#define DMA_TX_FREE(s)		{wmt_free_dma(s->tx_dmach); s->tx_dmach = NULL_DMA; }
#define DMA_TX_START(s, d, l)	wmt_start_dma(s->tx_dmach, d, 0, l)
#define DMA_TX_POS(s)		wmt_get_dma_pos(s->tx_dmach)
#define DMA_TX_STOP(s)		wmt_stop_dma(s->tx_dmach)
#define DMA_TX_CLEAR(s)		wmt_clear_dma(s->tx_dmach)
#define DMA_TX_RESET(s)		wmt_reset_dma(s->tx_dmach)
#define NULL_DMA                ((dmach_t)(-1))
#endif



#ifdef DEBUG_SERIAL_WMT
#define DEBUG_INTR(fmt...)	printk(fmt)
#else
#define DEBUG_INTR(fmt...)	do { } while (0)
#endif


#define UART_BR_115K2 115200

/*
 * This is for saving useful I/O registers
 */

/*
 * RS232 on DB9
 * Pin No.      Name    Notes/Description
 * 1            DCD     Data Carrier Detect
 * 2            RD      Receive Data (a.k.a RxD, Rx)
 * 3            TD      Transmit Data (a.k.a TxD, Tx)
 * 4            DTR     Data Terminal Ready
 * 5            SGND    Ground
 * 6            DSR     Data Set Ready
 * 7            RTS     Request To Send
 * 8            CTS     Clear To Send
 * 9            RI      Ring Indicator
 */

/*
 * We've been assigned a range on the "Low-density serial ports" major
 *
 * dev          Major           Minor
 * ttyVT0       204             90
 * ttyS0        4               64
 */
#ifdef CONFIG_SERIAL_WMT_TTYVT
		#define SERIAL_WMT_MAJOR     204
		#define MINOR_START          90      /* Start from ttyVT0 */
		#define CALLOUT_WMT_MAJOR    205     /* for callout device */
#else
		#define SERIAL_WMT_MAJOR     4
		#define MINOR_START          64      /* Start from ttyS0 */
		#define CALLOUT_WMT_MAJOR    5       /* for callout device */
#endif

#ifdef CONFIG_UART_2_3_ENABLE
#define NR_PORTS				4
#else
#define NR_PORTS				2
#endif
#define WMT_ISR_PASS_LIMIT   256

struct wmt_port {
	struct uart_port	port;
	struct timer_list	timer;
	struct timer_list	rx_timer;
#ifdef CONFIG_SERIAL_WMT_DMA
	/* RX Buffer0 physical address */
	dma_addr_t uart_rx_dma_phy0_org;
	/* RX Buffer1 physical address */
	dma_addr_t uart_rx_dma_phy1_org;
	/* RX Buffer2 physical address */
	dma_addr_t uart_rx_dma_phy2_org;
	/* RX Buffer0 virtual address */
	char *uart_rx_dma_buf0_org;
	/* RX Buffer1 virtual address */
	char *uart_rx_dma_buf1_org;
	/* RX Buffer2 virtual address */
	char *uart_rx_dma_buf2_org;
	/* RX Buffer0 virtual address, this address is the data should be read */
	char *uart_dma_tmp_buf0;
	/* RX Buffer1 virtual address, this address is the data should be read */
	char *uart_dma_tmp_buf1;
	/* RX Buffer2 virtual address, this address is the data should be read */
	char *uart_dma_tmp_buf2;
	/* RX Buffer0 physical address, this address is the data should be read */
	dma_addr_t uart_dma_tmp_phy0;
	/* RX Buffer1 physical address, this address is the data should be read */
	dma_addr_t uart_dma_tmp_phy1;
	/* RX Buffer2 physical address, this address is the data should be read */
	dma_addr_t uart_dma_tmp_phy2;
	/* RX device identifier for DMA */
	enum dma_device_e dma_rx_dev;
	/* TX device identifier for DMA */
	enum dma_device_e dma_tx_dev;
	/* RX DMA device config */
	struct dma_device_cfg_s dma_rx_cfg;
	/* TX DMA device config */
	struct dma_device_cfg_s dma_tx_cfg;
	/* RX DMA channel number */
	dmach_t rx_dmach;
	/* TX DMA channel number */
	dmach_t tx_dmach;
	/* RX dma callback function record which buffer the DMA used */
	unsigned int buffer_used;
	/* The buffer rx_char function should used (virtual address) */
	unsigned int buffer_selected;
	/* The buffer rx_count function should used (physical address) */
	unsigned int buffer_rx_count_selected;
	/* TX Buffer0 virtual address */
	char *uart_tx_dma_buf0_org;
	/* TX Buffer0 physical address */
	dma_addr_t uart_tx_dma_phy0_org;
	/* Record TX DMA running status : DMA_TX_END, DMA_TX_CHAR, DMA_TX_XMIT */
	unsigned int uart_tx_dma_flag;
	/* TX dma transmit counter*/
	unsigned int uart_tx_count;
	/* RX dma buffer last position*/
	unsigned int last_pos;
	/* Record the number of RX dma timeout function with no data transmit*/
	unsigned int uart_rx_dma_flag;
	unsigned int dma_tx_cnt;
#endif
	unsigned int old_status;
	/* identification string */
	char *id;
	unsigned int old_urdiv;
	unsigned int old_urlcr;
	unsigned int old_urier;
	unsigned int old_urfcr;
	unsigned int old_urtod;
};

#ifdef CONFIG_SERIAL_WMT_DMA
#define DMA_TX_END 0
#define DMA_TX_CHAR 1
#define DMA_TX_XMIT 2
#endif


/*
 * WMT UART registers set structure.
 */
struct wmt_uart {
	unsigned int volatile urtdr;            /* 0x00*/
	unsigned int volatile urrdr;            /* 0x04*/
	unsigned int volatile urdiv;            /* 0x08*/
	unsigned int volatile urlcr;            /* 0x0C*/
	unsigned int volatile uricr;            /* 0x10*/
	unsigned int volatile urier;            /* 0x14*/
	unsigned int volatile urisr;            /* 0x18*/
	unsigned int volatile urusr;            /* 0x1C*/
	unsigned int volatile urfcr;            /* 0x20*/
	unsigned int volatile urfidx;           /* 0x24*/
	unsigned int volatile urbkr;            /* 0x28*/
	unsigned int volatile urtod;            /* 0x2C*/
	unsigned int volatile resv30_FFF[0x3F4];	/* 0x0030 - 0x0FFF Reserved*/
	unsigned char volatile urtxf[32];       /* 0x1000 - 0x101F*/
	unsigned char volatile urrxf[32];      /* 0x1020 - 0x103F*/
};

struct baud_info_s {
	unsigned int baud;		/* baud rate */
	unsigned int brd;		/* baud rate divisor */
	unsigned int bcv;		/* break counter value at this baud rate
							 * simply be calculated by baud * 0.004096
							 */
};
#ifdef UART_DEBUG
unsigned int *DMA_pbuf =NULL;
unsigned int *COUNT_pbuf =NULL;
unsigned int *CPU_pbuf =NULL;
unsigned int dma_write_index = 0x00;
#endif
int mtk6622_tty = -1;
extern int wmt_getsyspara(char *varname, char *varval, int *varlen);

static struct baud_info_s baud_table[] = {
	{   3600,  0x100FF,    15 },
	{   7600,  0x1007F,    30 },
	{   9600,  0x2003F,    39 },
	{  14400,  0x1003F,    59 },
	{  19200,  0x2001F,    79 },
	{  28800,  0x1001F,   118 },
	{  38400,  0x2000F,   157 },
	{  57600,  0x1000F,   236 },
	{ 115200,   0x10007,   472 },
	{ 230400,   0x10003,   944 },
	{ 460800,   0x10001,  1920 },
	{ 921600,   0x10000,  3775 },
};

